
"Quarterly" = "Sekolah Sabat di satu tempat";

"Lesson" = "Pelajaran mingguan";

"Reading" = "Baca & Belajar Sekolah Sabat";

"Verse" = "Ayat-ayat Alkitab di tangan";

"Theme" = "Pengalaman membaca yang dapat disesuaikan";
